huang-399/esp32p4-smart-irrigation/components/device_registry/device_registry.c
#include "device_registry.h"

#include "bsp/esp32_p4_wifi6_touch_lcd_x.h"
#include "esp_check.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "nvs.h"
#include "nvs_flash.h"

#include <errno.h>
#include <stdio.h>
#include <string.h>
#include <sys/stat.h>

static const char *TAG = "dev_reg";

#define NVS_NAMESPACE        "dev_reg"
#define TF_CONFIG_DIR        "config"
#define TF_SNAPSHOT_FILE     "device_registry.bin"
#define TF_SNAPSHOT_VERSION  2
#define TF_SNAPSHOT_MAGIC    "DEVREG1"

typedef struct __attribute__((packed)) {
    char magic[8];
    uint32_t version;
    uint32_t device_count;
    uint32_t valve_count;
    uint32_t sensor_count;
    uint32_t zone_count;
    uint32_t device_size;
    uint32_t valve_size;
    uint32_t sensor_size;
    uint32_t zone_size;
} dev_registry_snapshot_header_t;

typedef struct __attribute__((packed)) {
    uint8_t    valid;
    uint8_t    type;
    uint8_t    channel;
    uint8_t    reserved;
    uint16_t   parent_device_id;
    uint16_t   id;
    char       name[DEV_REG_NAME_LEN];
} dev_valve_info_v1_t;

typedef struct __attribute__((packed)) {
    uint8_t    valid;
    uint8_t    valve_count;
    uint8_t    device_count;
    uint8_t    reserved;
    uint16_t   valve_ids[DEV_REG_ZONE_MAX_VALVES];
    uint16_t   device_ids[DEV_REG_ZONE_MAX_DEVICES];
    char       name[DEV_REG_NAME_LEN];
} dev_zone_info_v1_t;

static void convert_valve_v1_to_v2(dev_valve_info_t *dst, const dev_valve_info_v1_t *src)
{
    if (!dst || !src) {
        return;
    }

    memset(dst, 0, sizeof(*dst));
    dst->valid = src->valid;
    dst->type = src->type;
    dst->channel = src->channel;
    dst->reserved = src->reserved;
    dst->parent_device_id = src->parent_device_id;
    dst->id = src->id;
    memcpy(dst->name, src->name, sizeof(src->name));
    dst->name[DEV_REG_NAME_LEN - 1] = '\0';
}

static void convert_zone_v1_to_v2(dev_zone_info_t *dst, const dev_zone_info_v1_t *src)
{
    if (!dst || !src) {
        return;
    }

    memset(dst, 0, sizeof(*dst));
    dst->valid = src->valid;
    dst->valve_count = src->valve_count;
    dst->device_count = src->device_count;
    dst->reserved = src->reserved;
    for (int i = 0; i < DEV_REG_ZONE_MAX_VALVES; i++) {
        dst->valve_ids[i] = src->valve_ids[i];
    }
    memcpy(dst->device_ids, src->device_ids, sizeof(src->device_ids));
    memcpy(dst->name, src->name, sizeof(src->name));
    dst->name[DEV_REG_NAME_LEN - 1] = '\0';
}

/* ---- 静态数据 ---- */
static dev_device_info_t s_devices[DEV_REG_MAX_DEVICES];
static dev_valve_info_t  s_valves[DEV_REG_MAX_VALVES];
static dev_sensor_info_t s_sensors[DEV_REG_MAX_SENSORS];
static dev_zone_info_t   s_zones[DEV_REG_MAX_ZONES];
static SemaphoreHandle_t s_mutex = NULL;
static bool s_inited = false;
static bool s_storage_available = false;
static bool s_legacy_nvs_cleared = false;

/* ---- 后台快照持久化（不阻塞 LVGL 线程） ---- */
typedef struct {
    uint8_t type;   /* 0=device, 1=valve, 2=sensor, 3=zone */
    uint8_t slot;
} persist_msg_t;

static QueueHandle_t s_persist_queue = NULL;

/* ---- 类型名称表 ---- */
static const char *s_dev_type_names[] = {
    "8路控制器", "16路控制器", "32路控制器",
    "Zigbee终端节点", "Zigbee终端节点", "虚拟节点"
};

static uint8_t next_valve_suffix_for_parent(uint16_t parent_device_id)
{
    bool used[100] = {false};

    for (int i = 0; i < DEV_REG_MAX_VALVES; i++) {
        if (!s_valves[i].valid || s_valves[i].parent_device_id != parent_device_id) {
            continue;
        }

        uint32_t base_id = (uint32_t)parent_device_id * 100U;
        if (s_valves[i].id <= base_id) {
            continue;
        }

        uint32_t suffix = s_valves[i].id - base_id;
        if (suffix >= 1U && suffix <= 99U) {
            used[suffix] = true;
        }
    }

    for (uint8_t suffix = 1; suffix <= 99; suffix++) {
        if (!used[suffix]) {
            return suffix;
        }
    }

    return 0;
}

static bool valve_registry_is_id_taken_locked(uint32_t id)
{
    for (int i = 0; i < DEV_REG_MAX_VALVES; i++) {
        if (s_valves[i].valid && s_valves[i].id == id) {
            return true;
        }
    }
    return false;
}

static bool device_registry_exists_locked(uint16_t id)
{
    for (int i = 0; i < DEV_REG_MAX_DEVICES; i++) {
        if (s_devices[i].valid && s_devices[i].id == id) {
            return true;
        }
    }
    return false;
}

static esp_err_t read_snapshot_section(FILE *fp, void *buf, size_t size)
{
    if (fread(buf, size, 1, fp) != 1) {
        return ESP_ERR_INVALID_SIZE;
    }
    return ESP_OK;
}

static const char *s_port_names[] = {
    "RS485-1", "RS485-2", "RS485-3", "RS485-4", "串口连接"
};

static const char *s_sensor_type_names[] = {
    "氮(N)", "磷(P)", "钾(K)", "温度", "湿度",
    "光照", "流量", "压力", "液位", "阀门状态", "开关状态"
};

static const char *s_valve_type_names[] = {
    "电磁阀"
};

static int count_valid_devices(void)
{
    int count = 0;
    for (int i = 0; i < DEV_REG_MAX_DEVICES; i++) {
        if (s_devices[i].valid) {
            count++;
        }
    }
    return count;
}

static int count_valid_valves(void)
{
    int count = 0;
    for (int i = 0; i < DEV_REG_MAX_VALVES; i++) {
        if (s_valves[i].valid) {
            count++;
        }
    }
    return count;
}

static int count_valid_sensors(void)
{
    int count = 0;
    for (int i = 0; i < DEV_REG_MAX_SENSORS; i++) {
        if (s_sensors[i].valid) {
            count++;
        }
    }
    return count;
}

static int count_valid_zones(void)
{
    int count = 0;
    for (int i = 0; i < DEV_REG_MAX_ZONES; i++) {
        if (s_zones[i].valid) {
            count++;
        }
    }
    return count;
}

static void build_snapshot_path(char *path, size_t path_size)
{
    snprintf(path, path_size, "%s/%s/%s", BSP_SD_MOUNT_POINT, TF_CONFIG_DIR, TF_SNAPSHOT_FILE);
}

static bool is_sd_mount_point_ready(void)
{
    struct stat st = {0};
    return (stat(BSP_SD_MOUNT_POINT, &st) == 0) && S_ISDIR(st.st_mode);
}

static esp_err_t ensure_directory_exists(const char *path)
{
    struct stat st = {0};

    if (!path || path[0] == '\0') {
        return ESP_ERR_INVALID_ARG;
    }

    if (stat(path, &st) == 0) {
        return S_ISDIR(st.st_mode) ? ESP_OK : ESP_FAIL;
    }

