huang-399/esp32p4-smart-irrigation/components/device_registry/device_registry.c
    if (mkdir(path, 0775) == 0 || errno == EEXIST) {
        return ESP_OK;
    }

    ESP_LOGW(TAG, "mkdir failed for %s: errno=%d", path, errno);
    return ESP_FAIL;
}

static esp_err_t ensure_tf_ready(void)
{
    char config_dir[160];
    esp_err_t ret = ESP_OK;

    if (!is_sd_mount_point_ready()) {
        ret = bsp_sdcard_mount();
        if (ret != ESP_OK) {
            s_storage_available = false;
            ESP_LOGW(TAG, "TF mount failed: %s", esp_err_to_name(ret));
            return ret;
        }
    }

    snprintf(config_dir, sizeof(config_dir), "%s/%s", BSP_SD_MOUNT_POINT, TF_CONFIG_DIR);
    ret = ensure_directory_exists(config_dir);
    if (ret != ESP_OK) {
        s_storage_available = false;
        return ret;
    }

    s_storage_available = true;
    return ESP_OK;
}

static esp_err_t save_snapshot_to_tf_locked(void)
{
    char path[192];
    char temp_path[200];
    FILE *fp;
    dev_registry_snapshot_header_t header = {
        .magic = TF_SNAPSHOT_MAGIC,
        .version = TF_SNAPSHOT_VERSION,
        .device_count = (uint32_t)count_valid_devices(),
        .valve_count = (uint32_t)count_valid_valves(),
        .sensor_count = (uint32_t)count_valid_sensors(),
        .zone_count = (uint32_t)count_valid_zones(),
        .device_size = sizeof(dev_device_info_t),
        .valve_size = sizeof(dev_valve_info_t),
        .sensor_size = sizeof(dev_sensor_info_t),
        .zone_size = sizeof(dev_zone_info_t),
    };

    esp_err_t ret = ensure_tf_ready();
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "TF storage unavailable, skip snapshot save: %s", esp_err_to_name(ret));
        return ret;
    }

    build_snapshot_path(path, sizeof(path));
    snprintf(temp_path, sizeof(temp_path), "%s.tmp", path);

    fp = fopen(temp_path, "wb");
    if (!fp) {
        ESP_LOGE(TAG, "Open snapshot temp file failed: %s", temp_path);
        s_storage_available = false;
        return ESP_FAIL;
    }

    if (fwrite(&header, sizeof(header), 1, fp) != 1 ||
        fwrite(s_devices, sizeof(s_devices), 1, fp) != 1 ||
        fwrite(s_valves, sizeof(s_valves), 1, fp) != 1 ||
        fwrite(s_sensors, sizeof(s_sensors), 1, fp) != 1 ||
        fwrite(s_zones, sizeof(s_zones), 1, fp) != 1) {
        fclose(fp);
        remove(temp_path);
        ESP_LOGE(TAG, "Write TF snapshot failed");
        s_storage_available = false;
        return ESP_FAIL;
    }

    fclose(fp);

    if (remove(path) != 0 && errno != ENOENT) {
        ESP_LOGW(TAG, "Remove old snapshot failed: errno=%d", errno);
    }

    if (rename(temp_path, path) != 0) {
        remove(temp_path);
        ESP_LOGE(TAG, "Rename snapshot file failed: errno=%d", errno);
        s_storage_available = false;
        return ESP_FAIL;
    }

    s_storage_available = true;
    return ESP_OK;
}

static esp_err_t load_snapshot_from_tf(void)
{
    char path[192];
    FILE *fp;
    dev_registry_snapshot_header_t header;
    esp_err_t ret = ensure_tf_ready();
    bool migrated = false;

    if (ret != ESP_OK) {
        return ret;
    }

    build_snapshot_path(path, sizeof(path));
    fp = fopen(path, "rb");
    if (!fp) {
        return ESP_ERR_NOT_FOUND;
    }

    if (fread(&header, sizeof(header), 1, fp) != 1) {
        fclose(fp);
        return ESP_ERR_INVALID_RESPONSE;
    }

    if (memcmp(header.magic, TF_SNAPSHOT_MAGIC, sizeof(header.magic)) != 0 ||
        header.device_size != sizeof(dev_device_info_t) ||
        header.sensor_size != sizeof(dev_sensor_info_t)) {
        fclose(fp);
        ESP_LOGW(TAG, "TF snapshot header mismatch, ignore file");
        return ESP_ERR_INVALID_VERSION;
    }

    if (header.version == TF_SNAPSHOT_VERSION &&
        header.valve_size == sizeof(dev_valve_info_t) &&
        header.zone_size == sizeof(dev_zone_info_t)) {
        ret = read_snapshot_section(fp, s_devices, sizeof(s_devices));
        if (ret == ESP_OK) ret = read_snapshot_section(fp, s_valves, sizeof(s_valves));
        if (ret == ESP_OK) ret = read_snapshot_section(fp, s_sensors, sizeof(s_sensors));
        if (ret == ESP_OK) ret = read_snapshot_section(fp, s_zones, sizeof(s_zones));
        if (ret != ESP_OK) {
            fclose(fp);
            ESP_LOGW(TAG, "TF snapshot content incomplete, ignore file");
            return ret;
        }
    } else if (header.version == 1 &&
               header.valve_size == sizeof(dev_valve_info_v1_t) &&
               header.zone_size == sizeof(dev_zone_info_v1_t)) {
        dev_valve_info_v1_t old_valves[DEV_REG_MAX_VALVES] = {0};
        dev_zone_info_v1_t old_zones[DEV_REG_MAX_ZONES] = {0};

        ret = read_snapshot_section(fp, s_devices, sizeof(s_devices));
        if (ret == ESP_OK) ret = read_snapshot_section(fp, old_valves, sizeof(old_valves));
        if (ret == ESP_OK) ret = read_snapshot_section(fp, s_sensors, sizeof(s_sensors));
        if (ret == ESP_OK) ret = read_snapshot_section(fp, old_zones, sizeof(old_zones));
        if (ret != ESP_OK) {
            fclose(fp);
            ESP_LOGW(TAG, "TF snapshot v1 content incomplete, ignore file");
            return ret;
        }

        memset(s_valves, 0, sizeof(s_valves));
        memset(s_zones, 0, sizeof(s_zones));
        for (int i = 0; i < DEV_REG_MAX_VALVES; i++) {
            convert_valve_v1_to_v2(&s_valves[i], &old_valves[i]);
        }
        for (int i = 0; i < DEV_REG_MAX_ZONES; i++) {
            convert_zone_v1_to_v2(&s_zones[i], &old_zones[i]);
        }
        migrated = true;
    } else {
        fclose(fp);
        ESP_LOGW(TAG, "TF snapshot version/size mismatch, ignore file");
        return ESP_ERR_INVALID_VERSION;
    }

    fclose(fp);
    s_storage_available = true;

    if (migrated) {
        ESP_LOGI(TAG, "Migrated TF snapshot v1 to v2 in memory");
        ret = save_snapshot_to_tf_locked();
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "Rewrite TF snapshot to v2 failed: %s", esp_err_to_name(ret));
        }
    }

    return ESP_OK;
}

/* ---- NVS 加载（兼容旧整 blob 格式，自动迁移） ---- */
static esp_err_t clear_legacy_nvs_namespace(void)
{
    nvs_handle_t handle;
    esp_err_t ret = nvs_open(NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (ret == ESP_ERR_NVS_NOT_FOUND) {
        s_legacy_nvs_cleared = true;
        return ESP_OK;
    }
    if (ret != ESP_OK) {
        return ret;
    }

    ret = nvs_erase_all(handle);
    if (ret == ESP_OK) {
        ret = nvs_commit(handle);
    }
    nvs_close(handle);

    if (ret == ESP_OK) {
        s_legacy_nvs_cleared = true;
        ESP_LOGI(TAG, "Cleared legacy NVS namespace after TF confirmation");
    }
    return ret;
}

