huang-399/esp32p4-smart-irrigation/components/device_registry/device_registry.c
static esp_err_t clear_legacy_nvs_if_safe(void)
{
    if (s_legacy_nvs_cleared || !s_storage_available) {
        return ESP_OK;
    }
    return clear_legacy_nvs_namespace();
}

static esp_err_t load_valves_from_nvs_entry(nvs_handle_t handle, const char *key, dev_valve_info_t *out)
{
    size_t len = 0;
    esp_err_t ret;

    if (!key || !out) {
        return ESP_ERR_INVALID_ARG;
    }

    ret = nvs_get_blob(handle, key, NULL, &len);
    if (ret != ESP_OK) {
        return ret;
    }

    if (len == sizeof(dev_valve_info_t)) {
        return nvs_get_blob(handle, key, out, &len);
    }

    if (len == sizeof(dev_valve_info_v1_t)) {
        dev_valve_info_v1_t old_valve = {0};
        ret = nvs_get_blob(handle, key, &old_valve, &len);
        if (ret == ESP_OK) {
            convert_valve_v1_to_v2(out, &old_valve);
        }
        return ret;
    }

    return ESP_ERR_INVALID_SIZE;
}

static esp_err_t load_zones_from_nvs_entry(nvs_handle_t handle, const char *key, dev_zone_info_t *out)
{
    size_t len = 0;
    esp_err_t ret;

    if (!key || !out) {
        return ESP_ERR_INVALID_ARG;
    }

    ret = nvs_get_blob(handle, key, NULL, &len);
    if (ret != ESP_OK) {
        return ret;
    }

    if (len == sizeof(dev_zone_info_t)) {
        return nvs_get_blob(handle, key, out, &len);
    }

    if (len == sizeof(dev_zone_info_v1_t)) {
        dev_zone_info_v1_t old_zone = {0};
        ret = nvs_get_blob(handle, key, &old_zone, &len);
        if (ret == ESP_OK) {
            convert_zone_v1_to_v2(out, &old_zone);
        }
        return ret;
    }

    return ESP_ERR_INVALID_SIZE;
}

static esp_err_t load_from_nvs(void)
{
    nvs_handle_t handle;
    esp_err_t ret = nvs_open(NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (ret == ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGI(TAG, "NVS namespace not found, starting empty");
        s_legacy_nvs_cleared = true;
        return ESP_ERR_NOT_FOUND;
    }
    ESP_RETURN_ON_ERROR(ret, TAG, "nvs_open failed");

    size_t len;
    bool migrated = false;

    len = sizeof(s_devices);
    ret = nvs_get_blob(handle, "devices", s_devices, &len);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "Migrating devices from old blob format");
        for (int i = 0; i < DEV_REG_MAX_DEVICES; i++) {
            if (s_devices[i].valid) {
                char key[8];
                snprintf(key, sizeof(key), "d_%d", i);
                nvs_set_blob(handle, key, &s_devices[i], sizeof(dev_device_info_t));
            }
        }
        nvs_erase_key(handle, "devices");
        migrated = true;
    } else {
        for (int i = 0; i < DEV_REG_MAX_DEVICES; i++) {
            char key[8];
            snprintf(key, sizeof(key), "d_%d", i);
            len = sizeof(dev_device_info_t);
            ret = nvs_get_blob(handle, key, &s_devices[i], &len);
            if (ret != ESP_OK) {
                memset(&s_devices[i], 0, sizeof(dev_device_info_t));
            }
        }
    }

    len = sizeof(s_valves);
    ret = nvs_get_blob(handle, "valves", s_valves, &len);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "Migrating valves from old blob format");
        for (int i = 0; i < DEV_REG_MAX_VALVES; i++) {
            if (s_valves[i].valid) {
                char key[8];
                snprintf(key, sizeof(key), "v_%d", i);
                nvs_set_blob(handle, key, &s_valves[i], sizeof(dev_valve_info_t));
            }
        }
        nvs_erase_key(handle, "valves");
        migrated = true;
    } else if (ret == ESP_ERR_NVS_INVALID_LENGTH && len == sizeof(dev_valve_info_v1_t) * DEV_REG_MAX_VALVES) {
        dev_valve_info_v1_t old_valves[DEV_REG_MAX_VALVES] = {0};
        ret = nvs_get_blob(handle, "valves", old_valves, &len);
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "Migrating valves from old v1 blob format");
            memset(s_valves, 0, sizeof(s_valves));
            for (int i = 0; i < DEV_REG_MAX_VALVES; i++) {
                convert_valve_v1_to_v2(&s_valves[i], &old_valves[i]);
                if (s_valves[i].valid) {
                    char key[8];
                    snprintf(key, sizeof(key), "v_%d", i);
                    nvs_set_blob(handle, key, &s_valves[i], sizeof(dev_valve_info_t));
                }
            }
            nvs_erase_key(handle, "valves");
            migrated = true;
        }
    } else {
        for (int i = 0; i < DEV_REG_MAX_VALVES; i++) {
            char key[8];
            snprintf(key, sizeof(key), "v_%d", i);
            ret = load_valves_from_nvs_entry(handle, key, &s_valves[i]);
            if (ret == ESP_OK) {
                if (nvs_set_blob(handle, key, &s_valves[i], sizeof(dev_valve_info_t)) == ESP_OK) {
                    migrated = true;
                }
            } else {
                memset(&s_valves[i], 0, sizeof(dev_valve_info_t));
            }
        }
    }

    len = sizeof(s_sensors);
    ret = nvs_get_blob(handle, "sensors", s_sensors, &len);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "Migrating sensors from old blob format");
        for (int i = 0; i < DEV_REG_MAX_SENSORS; i++) {
            if (s_sensors[i].valid) {
                char key[8];
                snprintf(key, sizeof(key), "s_%d", i);
                nvs_set_blob(handle, key, &s_sensors[i], sizeof(dev_sensor_info_t));
            }
        }
        nvs_erase_key(handle, "sensors");
        migrated = true;
    } else {
        for (int i = 0; i < DEV_REG_MAX_SENSORS; i++) {
            char key[8];
            snprintf(key, sizeof(key), "s_%d", i);
            len = sizeof(dev_sensor_info_t);
            ret = nvs_get_blob(handle, key, &s_sensors[i], &len);
            if (ret != ESP_OK) {
                memset(&s_sensors[i], 0, sizeof(dev_sensor_info_t));
            }
        }
    }

    len = sizeof(s_zones);
    ret = nvs_get_blob(handle, "zones", s_zones, &len);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "Migrating zones from old blob format");
        for (int i = 0; i < DEV_REG_MAX_ZONES; i++) {
            if (s_zones[i].valid) {
                char key[8];
                snprintf(key, sizeof(key), "z_%d", i);
                nvs_set_blob(handle, key, &s_zones[i], sizeof(dev_zone_info_t));
            }
        }
        nvs_erase_key(handle, "zones");
        migrated = true;
    } else if (ret == ESP_ERR_NVS_INVALID_LENGTH && len == sizeof(dev_zone_info_v1_t) * DEV_REG_MAX_ZONES) {
        dev_zone_info_v1_t old_zones[DEV_REG_MAX_ZONES] = {0};
        ret = nvs_get_blob(handle, "zones", old_zones, &len);
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "Migrating zones from old v1 blob format");
            memset(s_zones, 0, sizeof(s_zones));
            for (int i = 0; i < DEV_REG_MAX_ZONES; i++) {
                convert_zone_v1_to_v2(&s_zones[i], &old_zones[i]);
                if (s_zones[i].valid) {
                    char key[8];
                    snprintf(key, sizeof(key), "z_%d", i);
                    nvs_set_blob(handle, key, &s_zones[i], sizeof(dev_zone_info_t));
                }
            }
            nvs_erase_key(handle, "zones");
            migrated = true;
        }
    } else {
        for (int i = 0; i < DEV_REG_MAX_ZONES; i++) {
            char key[8];
            snprintf(key, sizeof(key), "z_%d", i);
            ret = load_zones_from_nvs_entry(handle, key, &s_zones[i]);
            if (ret == ESP_OK) {
                if (nvs_set_blob(handle, key, &s_zones[i], sizeof(dev_zone_info_t)) == ESP_OK) {
                    migrated = true;
                }
            } else {
                memset(&s_zones[i], 0, sizeof(dev_zone_info_t));
            }
        }
    }

