huang-399/esp32p4-smart-irrigation/components/device_registry/device_registry.c
    if (migrated) {
        nvs_commit(handle);
        ESP_LOGI(TAG, "NVS migration to per-entry format complete");
    }

    nvs_close(handle);
    return ESP_OK;
}

/* ---- 后台持久化任务和投递函数 ---- */
static void persist_task(void *param)
{
    (void)param;
    persist_msg_t msg;

    while (xQueueReceive(s_persist_queue, &msg, portMAX_DELAY) == pdTRUE) {
        persist_msg_t extra;
        (void)msg;

        while (xQueueReceive(s_persist_queue, &extra, 0) == pdTRUE) {
        }

        xSemaphoreTake(s_mutex, portMAX_DELAY);
        esp_err_t ret = save_snapshot_to_tf_locked();
        xSemaphoreGive(s_mutex);

        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "Persist TF snapshot failed: %s", esp_err_to_name(ret));
        }
    }
}

static void persist_post(uint8_t type, uint8_t slot)
{
    if (s_persist_queue) {
        persist_msg_t msg = { .type = type, .slot = slot };
        xQueueSend(s_persist_queue, &msg, 0);
    }
}

/* ========== 初始化 ========== */
esp_err_t device_registry_init(void)
{
    if (s_inited) {
        return ESP_OK;
    }

    s_mutex = xSemaphoreCreateMutex();
    if (!s_mutex) {
        ESP_LOGE(TAG, "Failed to create mutex");
        return ESP_ERR_NO_MEM;
    }

    memset(s_devices, 0, sizeof(s_devices));
    memset(s_valves, 0, sizeof(s_valves));
    memset(s_sensors, 0, sizeof(s_sensors));
    memset(s_zones, 0, sizeof(s_zones));

    esp_err_t ret = load_snapshot_from_tf();
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "Loaded device registry from TF snapshot");
        esp_err_t cleanup_ret = clear_legacy_nvs_if_safe();
        if (cleanup_ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to clear legacy device registry NVS: %s", esp_err_to_name(cleanup_ret));
        }
    } else {
        memset(s_devices, 0, sizeof(s_devices));
        memset(s_valves, 0, sizeof(s_valves));
        memset(s_sensors, 0, sizeof(s_sensors));
        memset(s_zones, 0, sizeof(s_zones));

        esp_err_t nvs_ret = load_from_nvs();
        if (nvs_ret == ESP_OK) {
            ESP_LOGI(TAG, "Loaded device registry from legacy NVS");
            xSemaphoreTake(s_mutex, portMAX_DELAY);
            esp_err_t tf_ret = save_snapshot_to_tf_locked();
            xSemaphoreGive(s_mutex);
            if (tf_ret == ESP_OK) {
                ESP_LOGI(TAG, "Migrated device registry from NVS to TF snapshot");
                esp_err_t cleanup_ret = clear_legacy_nvs_if_safe();
                if (cleanup_ret != ESP_OK) {
                    ESP_LOGW(TAG, "Failed to clear legacy device registry NVS: %s", esp_err_to_name(cleanup_ret));
                }
            } else {
                ESP_LOGW(TAG, "Device registry migration to TF skipped: %s", esp_err_to_name(tf_ret));
            }
        } else if (nvs_ret == ESP_ERR_NOT_FOUND) {
            ESP_LOGI(TAG, "No TF snapshot or legacy NVS data, starting empty registry");
        } else {
            ESP_LOGW(TAG, "Legacy NVS load error, starting with empty registry: %s", esp_err_to_name(nvs_ret));
        }
    }

    s_persist_queue = xQueueCreate(16, sizeof(persist_msg_t));
    if (!s_persist_queue) {
        ESP_LOGE(TAG, "Failed to create persist queue");
        vSemaphoreDelete(s_mutex);
        s_mutex = NULL;
        return ESP_ERR_NO_MEM;
    }

    if (xTaskCreate(persist_task, "dev_persist", 4096, NULL, 3, NULL) != pdPASS) {
        ESP_LOGE(TAG, "Failed to create persist task");
        vQueueDelete(s_persist_queue);
        s_persist_queue = NULL;
        vSemaphoreDelete(s_mutex);
        s_mutex = NULL;
        return ESP_ERR_NO_MEM;
    }

    ESP_LOGI(TAG, "Initialized: %d devices, %d valves, %d sensors, %d zones%s",
             count_valid_devices(),
             count_valid_valves(),
             count_valid_sensors(),
             count_valid_zones(),
             s_storage_available ? " (TF ready)" : " (TF unavailable)");

    s_inited = true;
    return ESP_OK;
}

/* ========== 设备 CRUD ========== */
int device_registry_get_count(void)
{
    int count = 0;
    for (int i = 0; i < DEV_REG_MAX_DEVICES; i++) {
        if (s_devices[i].valid) count++;
    }
    return count;
}

const dev_device_info_t *device_registry_get_all(void)
{
    return s_devices;
}

const dev_device_info_t *device_registry_get_by_id(uint16_t id)
{
    for (int i = 0; i < DEV_REG_MAX_DEVICES; i++) {
        if (s_devices[i].valid && s_devices[i].id == id) {
            return &s_devices[i];
        }
    }
    return NULL;
}

esp_err_t device_registry_add(const dev_device_info_t *dev)
{
    if (!dev) return ESP_ERR_INVALID_ARG;

    xSemaphoreTake(s_mutex, portMAX_DELAY);

    for (int i = 0; i < DEV_REG_MAX_DEVICES; i++) {
        if (s_devices[i].valid && s_devices[i].id == dev->id) {
            xSemaphoreGive(s_mutex);
            ESP_LOGW(TAG, "Device ID %d already exists", dev->id);
            return ESP_ERR_INVALID_STATE;
        }
    }

    int slot = -1;
    for (int i = 0; i < DEV_REG_MAX_DEVICES; i++) {
        if (!s_devices[i].valid) {
            slot = i;
            break;
        }
    }
    if (slot < 0) {
        xSemaphoreGive(s_mutex);
        ESP_LOGW(TAG, "Device registry full");
        return ESP_ERR_NO_MEM;
    }

    memcpy(&s_devices[slot], dev, sizeof(dev_device_info_t));
    s_devices[slot].valid = 1;
    s_devices[slot].name[DEV_REG_NAME_LEN - 1] = '\0';

    xSemaphoreGive(s_mutex);
    persist_post(0, slot);
    return ESP_OK;
}

esp_err_t device_registry_remove(uint16_t id)
{
    xSemaphoreTake(s_mutex, portMAX_DELAY);

    for (int i = 0; i < DEV_REG_MAX_DEVICES; i++) {
        if (s_devices[i].valid && s_devices[i].id == id) {
            memset(&s_devices[i], 0, sizeof(dev_device_info_t));
            xSemaphoreGive(s_mutex);
            persist_post(0, i);
            return ESP_OK;
        }
    }

    xSemaphoreGive(s_mutex);
    return ESP_ERR_NOT_FOUND;
}

esp_err_t device_registry_update(uint16_t id, const dev_device_info_t *dev)
{
    if (!dev) return ESP_ERR_INVALID_ARG;
    xSemaphoreTake(s_mutex, portMAX_DELAY);

    for (int i = 0; i < DEV_REG_MAX_DEVICES; i++) {
        if (s_devices[i].valid && s_devices[i].id == id) {
            s_devices[i].type = dev->type;
            s_devices[i].port = dev->port;
            memcpy(s_devices[i].name, dev->name, DEV_REG_NAME_LEN);
            s_devices[i].name[DEV_REG_NAME_LEN - 1] = '\0';
            xSemaphoreGive(s_mutex);
            persist_post(0, i);
            return ESP_OK;
        }
    }

    xSemaphoreGive(s_mutex);
    return ESP_ERR_NOT_FOUND;
}

int device_registry_get_channel_count(uint16_t device_id)
{
    const dev_device_info_t *dev = device_registry_get_by_id(device_id);
    if (!dev) return 8;

    switch ((dev_type_t)dev->type) {
        case DEV_TYPE_CTRL_16CH: return 16;
        case DEV_TYPE_CTRL_32CH: return 32;
        default: return 8;
    }
}

/* ========== 阀门 CRUD ========== */
int valve_registry_get_count(void)
{
    int count = 0;
    for (int i = 0; i < DEV_REG_MAX_VALVES; i++) {
        if (s_valves[i].valid) count++;
    }
    return count;
}

const dev_valve_info_t *valve_registry_get_all(void)
{
    return s_valves;
}

