huang-399/esp32p4-smart-irrigation/components/device_registry/device_registry.c
esp_err_t valve_registry_add(const dev_valve_info_t *valve)
{
    if (!valve) return ESP_ERR_INVALID_ARG;

    xSemaphoreTake(s_mutex, portMAX_DELAY);

    if (!device_registry_exists_locked(valve->parent_device_id)) {
        xSemaphoreGive(s_mutex);
        ESP_LOGW(TAG, "Valve parent device %u not found", valve->parent_device_id);
        return ESP_ERR_NOT_FOUND;
    }

    int slot = -1;
    for (int i = 0; i < DEV_REG_MAX_VALVES; i++) {
        if (!s_valves[i].valid) {
            slot = i;
            break;
        }
    }
    if (slot < 0) {
        xSemaphoreGive(s_mutex);
        ESP_LOGW(TAG, "Valve registry full");
        return ESP_ERR_NO_MEM;
    }

    uint8_t suffix = next_valve_suffix_for_parent(valve->parent_device_id);
    if (suffix == 0) {
        xSemaphoreGive(s_mutex);
        ESP_LOGW(TAG, "Valve suffix exhausted for parent %u", valve->parent_device_id);
        return ESP_ERR_NO_MEM;
    }

    uint32_t new_id = (uint32_t)valve->parent_device_id * 100U + suffix;
    if (valve_registry_is_id_taken_locked(new_id)) {
        xSemaphoreGive(s_mutex);
        ESP_LOGW(TAG, "Valve ID %lu already exists", (unsigned long)new_id);
        return ESP_ERR_INVALID_STATE;
    }

    memcpy(&s_valves[slot], valve, sizeof(dev_valve_info_t));
    s_valves[slot].valid = 1;
    s_valves[slot].id = new_id;
    s_valves[slot].name[DEV_REG_NAME_LEN - 1] = '\0';

    xSemaphoreGive(s_mutex);
    persist_post(1, slot);
    return ESP_OK;
}

esp_err_t valve_registry_remove(uint32_t id)
{
    xSemaphoreTake(s_mutex, portMAX_DELAY);

    for (int i = 0; i < DEV_REG_MAX_VALVES; i++) {
        if (s_valves[i].valid && s_valves[i].id == id) {
            memset(&s_valves[i], 0, sizeof(dev_valve_info_t));
            xSemaphoreGive(s_mutex);
            persist_post(1, i);
            return ESP_OK;
        }
    }

    xSemaphoreGive(s_mutex);
    return ESP_ERR_NOT_FOUND;
}

esp_err_t valve_registry_update(uint32_t id, const dev_valve_info_t *valve)
{
    if (!valve) return ESP_ERR_INVALID_ARG;
    xSemaphoreTake(s_mutex, portMAX_DELAY);

    if (!device_registry_exists_locked(valve->parent_device_id)) {
        xSemaphoreGive(s_mutex);
        ESP_LOGW(TAG, "Valve parent device %u not found", valve->parent_device_id);
        return ESP_ERR_NOT_FOUND;
    }

    for (int i = 0; i < DEV_REG_MAX_VALVES; i++) {
        if (s_valves[i].valid && s_valves[i].id == id) {
            s_valves[i].type = valve->type;
            s_valves[i].channel = valve->channel;
            s_valves[i].parent_device_id = valve->parent_device_id;
            memcpy(s_valves[i].name, valve->name, DEV_REG_NAME_LEN);
            s_valves[i].name[DEV_REG_NAME_LEN - 1] = '\0';
            xSemaphoreGive(s_mutex);
            persist_post(1, i);
            return ESP_OK;
        }
    }

    xSemaphoreGive(s_mutex);
    return ESP_ERR_NOT_FOUND;
}

/* ========== 传感器 CRUD ========== */
int sensor_registry_get_count(void)
{
    int count = 0;
    for (int i = 0; i < DEV_REG_MAX_SENSORS; i++) {
        if (s_sensors[i].valid) count++;
    }
    return count;
}

const dev_sensor_info_t *sensor_registry_get_all(void)
{
    return s_sensors;
}

esp_err_t sensor_registry_add(const dev_sensor_info_t *sensor)
{
    if (!sensor) return ESP_ERR_INVALID_ARG;

    xSemaphoreTake(s_mutex, portMAX_DELAY);

    for (int i = 0; i < DEV_REG_MAX_SENSORS; i++) {
        if (s_sensors[i].valid && s_sensors[i].point_id == sensor->point_id) {
            xSemaphoreGive(s_mutex);
            ESP_LOGW(TAG, "Sensor point_id %lu already exists", (unsigned long)sensor->point_id);
            return ESP_ERR_INVALID_STATE;
        }
    }

    int slot = -1;
    for (int i = 0; i < DEV_REG_MAX_SENSORS; i++) {
        if (!s_sensors[i].valid) {
            slot = i;
            break;
        }
    }
    if (slot < 0) {
        xSemaphoreGive(s_mutex);
        ESP_LOGW(TAG, "Sensor registry full");
        return ESP_ERR_NO_MEM;
    }

    memcpy(&s_sensors[slot], sensor, sizeof(dev_sensor_info_t));
    s_sensors[slot].valid = 1;
    s_sensors[slot].name[DEV_REG_NAME_LEN - 1] = '\0';

    xSemaphoreGive(s_mutex);
    persist_post(2, slot);
    return ESP_OK;
}

esp_err_t sensor_registry_remove(uint32_t point_id)
{
    xSemaphoreTake(s_mutex, portMAX_DELAY);

    for (int i = 0; i < DEV_REG_MAX_SENSORS; i++) {
        if (s_sensors[i].valid && s_sensors[i].point_id == point_id) {
            memset(&s_sensors[i], 0, sizeof(dev_sensor_info_t));
            xSemaphoreGive(s_mutex);
            persist_post(2, i);
            return ESP_OK;
        }
    }

    xSemaphoreGive(s_mutex);
    return ESP_ERR_NOT_FOUND;
}

esp_err_t sensor_registry_update(uint32_t point_id, const dev_sensor_info_t *sensor)
{
    if (!sensor) return ESP_ERR_INVALID_ARG;
    xSemaphoreTake(s_mutex, portMAX_DELAY);

    for (int i = 0; i < DEV_REG_MAX_SENSORS; i++) {
        if (s_sensors[i].valid && s_sensors[i].point_id == point_id) {
            s_sensors[i].type = sensor->type;
            memcpy(s_sensors[i].name, sensor->name, DEV_REG_NAME_LEN);
            s_sensors[i].name[DEV_REG_NAME_LEN - 1] = '\0';
            xSemaphoreGive(s_mutex);
            persist_post(2, i);
            return ESP_OK;
        }
    }

    xSemaphoreGive(s_mutex);
    return ESP_ERR_NOT_FOUND;
}

bool sensor_registry_is_id_taken(uint32_t point_id)
{
    for (int i = 0; i < DEV_REG_MAX_SENSORS; i++) {
        if (s_sensors[i].valid && s_sensors[i].point_id == point_id) {
            return true;
        }
    }
    return false;
}

uint8_t sensor_registry_next_point_no(uint16_t parent_device_id)
{
    bool used[100] = {false};

    for (int i = 0; i < DEV_REG_MAX_SENSORS; i++) {
        if (s_sensors[i].valid && s_sensors[i].parent_device_id == parent_device_id) {
            uint8_t point_no = s_sensors[i].point_no;
            if (point_no >= 1 && point_no <= 99) {
                used[point_no] = true;
            }
        }
    }

    for (uint8_t point_no = 1; point_no <= 99; point_no++) {
        if (!used[point_no]) {
            return point_no;
        }
    }

    return 99;
}

/* ========== 灌区 CRUD ========== */
int zone_registry_get_count(void)
{
    int count = 0;
    for (int i = 0; i < DEV_REG_MAX_ZONES; i++) {
        if (s_zones[i].valid) count++;
    }
    return count;
}

