huang-399/esp32p4-smart-irrigation/components/device_registry/device_registry.c
const dev_zone_info_t *zone_registry_get_all(void)
{
    return s_zones;
}

esp_err_t zone_registry_add(const dev_zone_info_t *zone)
{
    if (!zone) return ESP_ERR_INVALID_ARG;

    xSemaphoreTake(s_mutex, portMAX_DELAY);

    int slot = -1;
    for (int i = 0; i < DEV_REG_MAX_ZONES; i++) {
        if (!s_zones[i].valid) {
            slot = i;
            break;
        }
    }
    if (slot < 0) {
        xSemaphoreGive(s_mutex);
        ESP_LOGW(TAG, "Zone registry full");
        return ESP_ERR_NO_MEM;
    }

    memcpy(&s_zones[slot], zone, sizeof(dev_zone_info_t));
    s_zones[slot].valid = 1;
    s_zones[slot].name[DEV_REG_NAME_LEN - 1] = '\0';

    xSemaphoreGive(s_mutex);
    persist_post(3, slot);
    return ESP_OK;
}

esp_err_t zone_registry_remove(int slot_index)
{
    if (slot_index < 0 || slot_index >= DEV_REG_MAX_ZONES) return ESP_ERR_INVALID_ARG;

    xSemaphoreTake(s_mutex, portMAX_DELAY);

    if (!s_zones[slot_index].valid) {
        xSemaphoreGive(s_mutex);
        return ESP_ERR_NOT_FOUND;
    }

    memset(&s_zones[slot_index], 0, sizeof(dev_zone_info_t));
    xSemaphoreGive(s_mutex);
    persist_post(3, slot_index);
    return ESP_OK;
}

esp_err_t zone_registry_update(int slot_index, const dev_zone_info_t *zone)
{
    if (!zone || slot_index < 0 || slot_index >= DEV_REG_MAX_ZONES) return ESP_ERR_INVALID_ARG;

    xSemaphoreTake(s_mutex, portMAX_DELAY);

    if (!s_zones[slot_index].valid) {
        xSemaphoreGive(s_mutex);
        return ESP_ERR_NOT_FOUND;
    }

    memcpy(&s_zones[slot_index], zone, sizeof(dev_zone_info_t));
    s_zones[slot_index].valid = 1;
    s_zones[slot_index].name[DEV_REG_NAME_LEN - 1] = '\0';

    xSemaphoreGive(s_mutex);
    persist_post(3, slot_index);
    return ESP_OK;
}

/* ========== 辅助函数 ========== */
int device_registry_build_dropdown_str(char *buf, int buf_size)
{
    if (!buf || buf_size <= 0) return 0;

    buf[0] = '\0';
    int pos = 0;
    int count = 0;

    for (int i = 0; i < DEV_REG_MAX_DEVICES; i++) {
        if (!s_devices[i].valid) continue;

        int written;
        if (count > 0) {
            if (pos < buf_size - 1) {
                buf[pos++] = '\n';
                buf[pos] = '\0';
            }
        }
        written = snprintf(buf + pos, buf_size - pos, "%s (%d)",
                           s_devices[i].name, s_devices[i].id);
        if (written > 0 && pos + written < buf_size) {
            pos += written;
        }
        count++;
    }

    return count;
}

const char *device_registry_type_name(dev_type_t type)
{
    if (type < DEV_TYPE_MAX) return s_dev_type_names[type];
    return "未知";
}

const char *device_registry_port_name(dev_port_t port)
{
    if (port < DEV_PORT_MAX) return s_port_names[port];
    return "未知";
}

const char *sensor_registry_type_name(sensor_type_t type)
{
    if (type < SENSOR_TYPE_MAX) return s_sensor_type_names[type];
    return "未知";
}

const char *valve_registry_type_name(valve_type_t type)
{
    if (type < VALVE_TYPE_MAX) return s_valve_type_names[type];
    return "未知";
}

/* ========== 查重函数 ========== */
bool device_registry_is_name_taken(const char *name)
{
    if (!name) return false;
    for (int i = 0; i < DEV_REG_MAX_DEVICES; i++) {
        if (s_devices[i].valid && strcmp(s_devices[i].name, name) == 0) {
            return true;
        }
    }
    return false;
}

bool device_registry_is_id_taken(uint16_t id)
{
    for (int i = 0; i < DEV_REG_MAX_DEVICES; i++) {
        if (s_devices[i].valid && s_devices[i].id == id) {
            return true;
        }
    }
    return false;
}

bool valve_registry_is_name_taken(const char *name)
{
    if (!name) return false;
    for (int i = 0; i < DEV_REG_MAX_VALVES; i++) {
        if (s_valves[i].valid && strcmp(s_valves[i].name, name) == 0) {
            return true;
        }
    }
    return false;
}

bool sensor_registry_is_name_taken(const char *name)
{
    if (!name) return false;
    for (int i = 0; i < DEV_REG_MAX_SENSORS; i++) {
        if (s_sensors[i].valid && strcmp(s_sensors[i].name, name) == 0) {
            return true;
        }
    }
    return false;
}

bool zone_registry_is_name_taken(const char *name)
{
    if (!name) return false;
    for (int i = 0; i < DEV_REG_MAX_ZONES; i++) {
        if (s_zones[i].valid && strcmp(s_zones[i].name, name) == 0) {
            return true;
        }
    }
    return false;
}
